brew "gcc"

# Taps

tap "homebrew/bundle"
tap "homebrew/cask"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "mas"
brew "zsh"
brew "chezmoi"

# Casks

cask 'font-fira-code'
cask "powershell"

# Python & Dependencies

brew "openssl" 
brew "readline" 
brew "sqlite3"
brew "xz" 
brew "zlib"
brew "pyenv"  
brew "awscli"
brew "azure-cli"
cask "google-cloud-sdk"
brew "kubernetes-cli"
brew "minikube"
brew "terraform"
brew "tflint"
brew "tfsec"
brew "vault"
brew "packer"
brew "node"
brew "helm"
brew "gitlab-ci-local"
brew "git"
brew "direnv"
brew "eksctl"
brew "argocd"
brew "go"
brew "wget"
brew "exa"
brew "glab"
brew "neovim"
